
let authors = {
    "М. Гоголь": "Дивуєшся дорогоцінності мови нашої: в ній що не звук, то подарунок, все крупно, зернисто, як самі перла.",
    "Е. Челебі": "Українці — стародавній народ, а мова їхня мова багатша і всеосяжніша, ніж персидська, китайська, монгольська і всілякі інші.",
    "О. Пахльовська": "Раби — це нація, котра не має Слова. Тому й не зможе захистить себе.",
    "І. Репін": "Відчуваю й усвідомлюю, яка це красива й легка українська мова.",
    "Олександр Олесь": "Для всіх ти мертва і смішна, Для всіх ти бідна і нещасна, Моя Україно пре-красна, Пісень і волі сторона."
};


function showQuote(author) {
    alert(authors[author]);
}


for (let author in authors) {
    document.getElementById(author).addEventListener('click', function() {
        showQuote(author);
    });
}
